Revit 2026 API

# SpaceUpperLimit Property

---

Get or set the Upper Limit of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Level UpperLimit { get; set; }
```
```vb
Public Property UpperLimit As Level
	Get
	Set
```
```cpp
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
```
```fsharp
member UpperLimit : Level with get, set
```

#### Property Value

Level

This property is used to get or set the Upper Limit of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace